#+title: Time log
#+MACRO: project (eval (project-name (project-current)))

* Intro
:LOGBOOK:
CLOCK: [2026-06-05 Fri 16:40]--[2026-06-05 Fri 16:48] =>  0:08
:END:

This is a log of the time and steps taken while working on the
{{{project}}}.  I can't say what the result as far as readability will
be.  The first git commit is April 8, 2026.  Today is June 5th.  I
have worked on this off and on so I can't say how many hours has been
put in before this log was started.

* Continue adding to Functions
:LOGBOOK:
CLOCK: [2026-06-10 Wed 08:00]--[2026-06-10 Wed 10:00] =>  2:00
CLOCK: [2026-06-09 Tue 14:42]--[2026-06-09 Tue 18:42] =>  4:00
CLOCK: [2026-06-08 Mon 20:36]--[2026-06-08 Mon 21:37] =>  1:01
CLOCK: [2026-06-05 Fri 16:48]--[2026-06-05 Fri 18:36] =>  1:48
CLOCK: [2026-06-06 Sat 16:48]--[2026-06-06 Sat 18:48] =>  2:00
CLOCK: [2026-06-07 Sun 16:48]--[2026-06-07 Sun 18:48] =>  2:00
CLOCK: [2026-06-08 Mon 16:48]--[2026-06-08 Mon 18:48] =>  2:00
:END:
I started adding to the text and got side tracked into something I've
kinda wanted to do for a while.  This directory is now set up using my
project-setups.org system so that I can define Org variables specific
for this project.  This was caused by me wanting to have the same
"icon" for the INFO button that Canon uses.  This will need to add to
the org-html-head which I haven't done yet.  It is time to eat.
Tomorrow's project.

I finished the description of all the functions.  In the process, I
pulled down the updated HTML versions of the R1 and R5m2 version 1.3.0
documentation and added in the new functions.

* Create ASCII versions of Menus
:LOGBOOK:
CLOCK: [2026-06-10 Wed 16:00]--[2026-06-10 Wed 17:20] =>  1:20
:END:

I'd like to have flat simple ASCII versions of the menus that easily
fit on a phone so that they can be loaded onto a phone and quickly
available.  I can't remember where particular menus are at and I think
this will help me since I will be able to search.

Well... that worked out rather nicely.  I fixed publish.el so that one
call will publish all the pieced and GitHub Pages is hosting it.
Fun!!

* Lets clean a few things up
:LOGBOOK:
CLOCK: [2026-06-13 Sat 08:15]--[2026-06-13 Sat 08:27] =>  0:12
CLOCK: [2026-06-10 Wed 17:24]--[2026-06-10 Wed 17:34] =>  0:10
:END:
Redid the README entirely.

I downloaded all of the web pages for the manuals from Canon for the
R1 and R5m2 in a separate directory.  I'm going to merge that with
this so it is easier to keep track of.

* Org export to EPUB
:LOGBOOK:
CLOCK: [2026-06-11 Thu 19:22]--[2026-06-11 Thu 21:01] =>  1:39
CLOCK: [2026-06-11 Thu 18:39]--[2026-06-11 Thu 18:54] =>  0:15
CLOCK: [2026-06-11 Thu 16:43]--[2026-06-11 Thu 18:39] =>  1:56
:END:
I have looked into this before but only superficially.  I am going to
spend some time seriously trying to create a very simple epub document
first and then see about getting Org to create an epub document.

* Learning org-roam
:LOGBOOK:
CLOCK: [2026-06-13 Sat 11:20]--[2026-06-13 Sat 11:26] =>  0:06
CLOCK: [2026-06-13 Sat 09:48]--[2026-06-13 Sat 11:19] =>  1:31
:END:

* Experimenting with Org and HTML 5
:PROPERTIES:
:ORDERED:  t
:END:
:LOGBOOK:
CLOCK: [2026-06-13 Sat 16:45]--[2026-06-13 Sat 18:29] =>  1:44
CLOCK: [2026-06-13 Sat 16:02]--[2026-06-13 Sat 16:45] =>  0:43
:END:
I first added description via ~#+DESCRIPTION: This is a description~
and looked and it creates a meta tag of name description and the
content is the description.  Then I tried ~#+HTML_DOCTYPE: xhtml5~ and
also ~#+HTML_DOCTYPE: html5~ and compared the two.  The ~html~ tag is
different.  In ~xhtml5~, ~html~ tag has the xmlns, lang, and xml:lang
attributes (yuck! but... I think that is what EPUB wants.  In ~html5~,
the ~html~ tag has only the lang attribute.  The rest of the content
was the same except for time stamps.

Now, lets see about org-html-html5-fancy.  I set it to t via
customize.  I then added a block for summary and details and that
worked.  I then noticed that I can set html5 fancy via options so I
removed the customized variable and did ~#+OPTIONS: html5-fancy:t~ and
that worked too!  Weee!!!

Pulled down the latest org mode source...

The tags listed in org-html-html5-elements are formatted via
org-html-special-block.  Unfortunately the content that is passed in
has already gone through org-html-paragraph and so it has a ~<p>~ tag
around both the summary and the detail.  However, if I hand edit the
html file and change ~<p>~ to ~<p style="display:inline;">~ in both
cases, then the paragraph tags essentially disappear.  Yeah!!! So now
I want to twiddle with the CSS but I've decided the way I'm doing the
CSS right now is bad.  The css needs to be a local file that is
included.  This means changing the project settings, etc.  Here
goes...

* Piece together primitive EPUB and use EPUBCheck
:LOGBOOK:
CLOCK: [2026-06-15 Mon 14:48]--[2026-06-15 Mon 20:27] =>  5:39
:END:
[[https://www.w3.org/publishing/epubcheck/][EPUBCheck]]
Continuing on with the experiments on HTML 5, I need to add a toc
entry and then see if I can bundle it up as a zip file that passes the
EPUBCheck (which I've not used yet).

Well... I got it to pass EPUBCheck but what a pain.  I should have
kept a list of all the things I needed to tweak.

* Add color to the menu text
:LOGBOOK:
CLOCK: [2026-06-21 Sun 16:15]--[2026-06-21 Sun 18:00] =>  1:45
CLOCK: [2026-06-18 Thu 15:43]--[2026-06-18 Thu 18:02] =>  2:19
:END:
I want a least a little bit of color when referencing a menu.  I'm not
sure how far to go on this.

Ok... I tried background color of red and I didn't like it for a
number of reasons so I quit.  I did add spans to the menu macros so
that they could be styled if anyone wants to bother.

Tried this again.  I'll see what Michael thinks.
